<a href="https://colab.research.google.com/github/prophecied/PortfolioProject/blob/main/pythonDAPandaSeries.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd
import numpy as np

In [ ]:
g7_pop = pd.Series([35.467, 63.951, 80.940, 60.665, 127.061, 64.511, 318.523])

In [ ]:
g7_pop

0     35.467
1     63.951
2     80.940
3     60.665
4    127.061
5     64.511
6    318.523
dtype: float64

In [ ]:
g7_pop.name = "G7 Population in millions"

In [ ]:
g7_pop

0     35.467
1     63.951
2     80.940
3     60.665
4    127.061
5     64.511
6    318.523
Name: G7 Population in millions, dtype: float64

In [ ]:
g7_pop.dtype

dtype('float64')

In [ ]:
g7_pop.values

array([ 35.467,  63.951,  80.94 ,  60.665, 127.061,  64.511, 318.523])

In [ ]:
type(g7_pop.values)

numpy.ndarray

In [ ]:
g7_pop[0]

35.467

In [ ]:
g7_pop[1]

63.951

In [ ]:
g7_pop.index

RangeIndex(start=0, stop=7, step=1)

In [ ]:
l = ["a", "b", "c"]

In [ ]:
g7_pop.index = [
    "Canada",
    "France",
    "Germany",
    "Italy",
    "Japan",
    "United Kingdom",
    "United States"
]

In [ ]:
g7_pop

Canada             35.467
France             63.951
Germany            80.940
Italy              60.665
Japan             127.061
United Kingdom     64.511
United States     318.523
Name: G7 Population in millions, dtype: float64

In [ ]:
pd.Series({
    "Canada": 35.467,
    "France": 63.951,
    "Germany": 8.94,
    "Italy": 60.665,
    "Japan": 127.061,
    "United Kingdom": 64.511,
    "United States": 318.423
}, name= "G7 Population in millions")

Canada             35.467
France             63.951
Germany             8.940
Italy              60.665
Japan             127.061
United Kingdom     64.511
United States     318.423
Name: G7 Population in millions, dtype: float64

In [ ]:
pd.Series(
    [35.467, 63.951, 80.94, 60.665, 127.061, 64.511, 318.523],
    index = ["Canada", "France", "Germany", "Italy", "Japan", "United Kingdom","United States"],
    name = "G7 Population in millions"
)

Canada             35.467
France             63.951
Germany            80.940
Italy              60.665
Japan             127.061
United Kingdom     64.511
United States     318.523
Name: G7 Population in millions, dtype: float64

In [ ]:
pd.Series(g7_pop, index=["France", "Germany", "Italy", "Spain"])

France     63.951
Germany    80.940
Italy      60.665
Spain         NaN
Name: G7 Population in millions, dtype: float64

In [ ]:
g7_pop

Canada             35.467
France             63.951
Germany            80.940
Italy              60.665
Japan             127.061
United Kingdom     64.511
United States     318.523
Name: G7 Population in millions, dtype: float64

In [ ]:
g7_pop['Canada']

35.467

In [ ]:
g7_pop['Japan']

127.061

In [ ]:
g7_pop.iloc[0]

35.467

In [ ]:
g7_pop.iloc[-1]

318.523

In [ ]:
g7_pop[['Italy', 'France']]

Italy     60.665
France    63.951
Name: G7 Population in millions, dtype: float64

In [ ]:
g7_pop.iloc[[0,1]]

Canada    35.467
France    63.951
Name: G7 Population in millions, dtype: float64

In [ ]:
g7_pop["Canda":"Italy"]

France     63.951
Germany    80.940
Italy      60.665
Name: G7 Population in millions, dtype: float64

In [ ]:
g7_pop > 70

Canada            False
France            False
Germany            True
Italy             False
Japan              True
United Kingdom    False
United States      True
Name: G7 Population in millions, dtype: bool

In [ ]:
g7_pop[g7_pop > 70]

Germany           80.940
Japan            127.061
United States    318.523
Name: G7 Population in millions, dtype: float64

In [ ]:
g7_pop.mean()

107.30257142857144

In [ ]:
g7_pop[g7_pop > g7_pop.mean()]

Japan            127.061
United States    318.523
Name: G7 Population in millions, dtype: float64

In [ ]:
g7_pop.std()

97.24996987121581

In [ ]:
g7_pop[(g7_pop > g7_pop.mean() - g7_pop.std()/2) | (g7_pop > g7_pop.mean() + g7_pop.std())]

France             63.951
Germany            80.940
Italy              60.665
Japan             127.061
United Kingdom     64.511
United States     318.523
Name: G7 Population in millions, dtype: float64

In [ ]:
g7_pop * 1_000_000

Canada             35467000.0
France             63951000.0
Germany            80940000.0
Italy              60665000.0
Japan             127061000.0
United Kingdom     64511000.0
United States     318523000.0
Name: G7 Population in millions, dtype: float64

In [ ]:
g7_pop.mean()

107.30257142857144

In [ ]:
np.log(g7_pop)

Canada            3.568603
France            4.158117
Germany           4.393708
Italy             4.105367
Japan             4.844667
United Kingdom    4.166836
United States     5.763695
Name: G7 Population in millions, dtype: float64

In [ ]:
g7_pop["France": "Italy"].mean()

68.51866666666666

In [ ]:
g7_pop > 80

Canada            False
France            False
Germany            True
Italy             False
Japan              True
United Kingdom    False
United States      True
Name: G7 Population in millions, dtype: bool

In [ ]:
g7_pop[g7_pop > 80]

Germany           80.940
Japan            127.061
United States    318.523
Name: G7 Population in millions, dtype: float64

In [ ]:
g7_pop[(g7_pop > 80) | (g7_pop < 40)]

Canada            35.467
Germany           80.940
Japan            127.061
United States    318.523
Name: G7 Population in millions, dtype: float64

In [ ]:
g7_pop[(g7_pop > 80) & (g7_pop < 200)]

Germany     80.940
Japan      127.061
Name: G7 Population in millions, dtype: float64

In [ ]:
g7_pop["Canada"] = 40.5

In [ ]:
g7_pop.iloc[-1] = 500

In [ ]:
g7_pop

Canada             40.500
France             63.951
Germany            80.940
Italy              60.665
Japan             127.061
United Kingdom     64.511
United States     500.000
Name: G7 Population in millions, dtype: float64

In [ ]:
g7_pop[g7_pop < 70]

Canada            40.500
France            63.951
Italy             60.665
United Kingdom    64.511
Name: G7 Population in millions, dtype: float64

In [ ]:
g7_pop[g7_pop < 70] = 99.99

In [ ]:
g7_pop

Canada             99.990
France             99.990
Germany            80.940
Italy              99.990
Japan             127.061
United Kingdom     99.990
United States     500.000
Name: G7 Population in millions, dtype: float64

Panda Series Exercise

Create an empty numpy Series

In [ ]:
pd.Series()

Series([], dtype: object)

Given the X python list convert it to an Y pandas Series

In [ ]:
X = ['A', 'B', 'C']
print(X, type(X))

Y = pd.Series(X)
print(Y, type(Y))

['A', 'B', 'C'] <class 'list'>
0    A
1    B
2    C
dtype: object <class 'pandas.core.series.Series'>

Given the X pandas Series, name it "My Letters"

In [ ]:
X = pd.Series(['A', 'B', 'C'])
X.name = "My Letters"
X

0    A
1    B
2    C
Name: My Letters, dtype: object

Given the X pandas Series, show its values

In [ ]:
X = pd.Series(['A', 'B', 'C'])
X.values

array(['A', 'B', 'C'], dtype=object)

Assign index names to the given X pandas Series

In [ ]:
X = pd.Series(['A', 'B', 'C'])
index_names = ['first', 'second', 'third']
X.index = index_names
X

first     A
second    B
third     C
dtype: object

Given the X pandas series, show its first element

In [ ]:
X = pd.Series(['A', 'B', 'C'], index = ['first', 'second', 'third'])
X['first']

'A'

Given the pandas Series show its last element

In [ ]:
X = pd.Series(['A', 'B', 'C'], index = ['first', 'second', 'third'])
X['third']

'C'

Given the X pandas series, show all middle elements

In [3]:
X = pd.Series(['A', 'B', 'C'], index = ['first', 'second', 'third'])
X[1:-1]

second    B
dtype: object

Given the X pandas series, sow the elements in reverse position

In [4]:
X = pd.Series(['A', 'B', 'C'], index = ['first', 'second', 'third'])
X[::-1]

third     C
second    B
first     A
dtype: object

Given the X pandas series show the first and last elements

In [5]:
X = pd.Series(['A', 'B', 'C'], index = ['first', 'second', 'third'])
X[[0,-1]]

<ipython-input-5-ea4668ad52cd>:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  X[[0,-1]]

first    A
third    C
dtype: object

Convert the given integer pandas series to float

In [6]:
X = pd.Series([1,2,3,4,5], index = ['first', 'second', 'third', 'fourth', 'fifth'])
pd.Series(X, dtype = float)

first     1.0
second    2.0
third     3.0
fourth    4.0
fifth     5.0
dtype: float64

Reverse the given pandas series

In [7]:
X = pd.Series([1,2,3,4,5], index = ['first', 'second', 'third', 'fourth', 'fifth'])
X[::-1]

fifth     5
fourth    4
third     3
second    2
first     1
dtype: int64

Order the given pandas series

In [8]:
X = pd.Series([4,2,5,1,3], index = ['first', 'second', 'third', 'fourth', 'fifth'])
X = X.sort_values()
X

fourth    1
second    2
fifth     3
first     4
third     5
dtype: int64

Given the X pandas series, set the fifth element equal to 10

In [10]:
X = pd.Series([1,2,3,4,5], index = ['first', 'second', 'third', 'fourth', 'fifth'])
X[4] = 10
X

<ipython-input-10-83fe351c5be2>:2: FutureWarning: Series.__setitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To set a value by position, use `ser.iloc[pos] = value`
  X[4] = 10

first      1
second     2
third      3
fourth     4
fifth     10
dtype: int64

Given the X pandas series change all the middle elements to 0

In [12]:
X = pd.Series([1,2,3,4,5], index = ['first', 'second', 'third', 'fourth', 'fifth'])
X[1:-1] = 0
X

first     1
second    0
third     0
fourth    0
fifth     5
dtype: int64

Given the X pandas series add 5 to every element

In [13]:
X = pd.Series([1,2,3,4,5], index = ['first', 'second', 'third', 'fourth', 'fifth'])
X + 5
X

first     1
second    2
third     3
fourth    4
fifth     5
dtype: int64

Given the X pandas series make a mask showing negative elements

In [14]:
X = pd.Series([-1,2,0,-4,5,6,0,0,-9,10])
mask = X < 0
mask

0     True
1    False
2    False
3     True
4    False
5    False
6    False
7    False
8     True
9    False
dtype: bool

Given the X pandas series get the negative elements

In [15]:
X = pd.Series([-1,2,0,-4,5,6,0,0,-9,10])
mask = X < 0
X[mask]

0   -1
3   -4
8   -9
dtype: int64

Given the X pandas series get numbers higher than 5

In [16]:
X = pd.Series([-1,2,0,-4,5,6,0,0,-9,10])
mask = X > 5
mask

0    False
1    False
2    False
3    False
4    False
5     True
6    False
7    False
8    False
9     True
dtype: bool

Given the X pandas series get number higher than the elements

In [17]:
X = pd.Series([-1,2,0,-4,5,6,0,0,-9,10])
mask = X > 5
X[mask]

5     6
9    10
dtype: int64

Given the X pandas series get numbers higher than the elements mean

In [18]:
X = pd.Series([-1,2,0,-4,5,6,0,0,-9,10])
mask = X > X.mean()
X[mask ]

1     2
4     5
5     6
9    10
dtype: int64

Given the X pandas series get numbers equal to 2 or 10

In [19]:
X = pd.Series([-1,2,0,-4,5,6,0,0,-9,10])
mask = (X==2)|(X==10)
X[mask]

1     2
9    10
dtype: int64

Given the X pandas series return True if none of its elements is zero

In [20]:
X = pd.Series([-1,2,0,-4,5,6,0,0,-9,10])
X.all()

False

Given the X pandas Series return True if any of its elements is zero

In [21]:
X = pd.Series([-1,2,0,-4,5,6,0,0,-9,10])
X.any()

True

Given the X pandas series, show the mean value of its elements

In [22]:
X = pd.Series([-1,2,0,-4,5,6,0,0,-9,10])
X.mean()

0.9

Given the X pandas series, show the max value of its elements

In [23]:
X = pd.Series([-1,2,0,-4,5,6,0,0,-9,10])
X.max()

10